# 需求：有一份账单文件，记录了消费收入的具体记录，内容如下：
# name,date,money,type,remarks
# 周杰轮,2022-01-01,100000,消费,正式
# 周杰轮,2022-01-02,300000,收入,正式
# 周杰轮,2022-01-03,100000,消费,测试
# 林俊节,2022-01-01,300000,收入,正式
# 林俊节,2022-01-02,100000,消费,测试
# 林俊节,2022-01-03,100000,消费,正式
# 林俊节,2022-01-04,100000,消费,测试
# 林俊节,2022-01-05,500000,收入,正式
# 张学油,2022-01-01,100000,消费,正式
# 张学油,2022-01-02,500000,收入,正式
# 张学油,2022-01-03,900000,收入,测试
# 王力鸿,2022-01-01,500000,消费,正式
# 王力鸿,2022-01-02,300000,消费,测试
# 王力鸿,2022-01-03,950000,收入,正式
# 刘德滑,2022-01-01,300000,消费,测试
# 刘德滑,2022-01-02,100000,消费,正式
# 刘德滑,2022-01-03,300000,消费,正式

# 需求：1.读取文件 将文件写出到bill.txt.bak文件作为备份，同时将文件内标记测试的数据行删除
# 1.打开文件
f=open("bills.txt","r",encoding="utf-8")

# 2.备份文件
fw = open("bill.txt.bak","w",encoding="utf-8")

# 3.for循环读文件内容

for line in f:
  line = line.strip()
#   判断内容，将满足的内容写出
  if line.split(",")[4] == "测试":
    continue
  fw.write(line)
  fw.write("\n")

fw.close()
f.close()
